In [1]:
import numpy as np
import pandas as pd

### Q2 Create pandas dataframe from different data structures

In [2]:
# Using lists
data_list = [['Sunita', 25, 'Engineer'],
             ['Rajesh', 30, 'Doctor'],
             ['Sarita', 35, 'Artist']]

# Using dictionaries
data_dict = {'Name': ['Sunita', 'Rajesh', 'Sarita'],
             'Age': [25, 30, 35],
             'Occupation': ['Engineer', 'Doctor', 'Artist']}

# Using tuples
data_tuples = [('Sunita', 25, 'Engineer'),
               ('Rajesh', 30, 'Doctor'),
               ('Sarita', 35, 'Artist')]

#Using numpy arrays
names = np.array(['Sunita', 'Rajesh', 'Sarita', 'Prashjeev', 'Hari', 'Bahadur', 'Sarita', 'Prashjeev', 'Bardan'])
ages = np.array([25, 30, "35", 24, 22, "50", 28, 24, 12])
occupations = np.array(['Engineer', 'Doctor', 'Artist', 'Engineer', 'Singer', 'Neta', 'Dentist', 'Engineer', 'Student'])
locations = np.array(["Kathmandu" for _ in range(4)] + ["Pokhara" for _ in range(3)] + ['Kathmandu'] + ['Pokhara'])
height = np.array(['170', '172', '140', '165', '180', '200', '155', '165', '160'])


# Create DataFrame from lists
df_list = pd.DataFrame(data_list, columns=['Name', 'Age', 'Occupation'])

# Create DataFrame from dictionary
df_dict = pd.DataFrame(data_dict)

# Create DataFrame from tuples
df_tuples = pd.DataFrame(data_tuples, columns=['Name', 'Age', 'Occupation'])

# Create DataFrame from arrays
df_arrays = pd.DataFrame({'Name': names, 'Age': ages, 'Occupation': occupations, 'Locations': locations, 'height_cm': height})


print("DataFrame from lists:")
print(df_list)
print("\nDataFrame from dictionary:")
print(df_dict)
print("\nDataFrame from tuples:")
print(df_tuples)
print("\nDataFrame from arrays:")
print(df_arrays)

DataFrame from lists:
     Name  Age Occupation
0  Sunita   25   Engineer
1  Rajesh   30     Doctor
2  Sarita   35     Artist

DataFrame from dictionary:
     Name  Age Occupation
0  Sunita   25   Engineer
1  Rajesh   30     Doctor
2  Sarita   35     Artist

DataFrame from tuples:
     Name  Age Occupation
0  Sunita   25   Engineer
1  Rajesh   30     Doctor
2  Sarita   35     Artist

DataFrame from arrays:
        Name Age Occupation  Locations height_cm
0     Sunita  25   Engineer  Kathmandu       170
1     Rajesh  30     Doctor  Kathmandu       172
2     Sarita  35     Artist  Kathmandu       140
3  Prashjeev  24   Engineer  Kathmandu       165
4       Hari  22     Singer    Pokhara       180
5    Bahadur  50       Neta    Pokhara       200
6     Sarita  28    Dentist    Pokhara       155
7  Prashjeev  24   Engineer  Kathmandu       165
8     Bardan  12    Student    Pokhara       160

### Q3 Type casting and type conversion in pandas

In [110]:
df_arrays['Age'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 9 entries, 0 to 8
Series name: Age
Non-Null Count  Dtype
--------------  -----
9 non-null      object
dtypes: object(1)
memory usage: 200.0+ bytes

In [111]:
# Type casting a column to integer
df_arrays['Age'] = df_arrays['Age'].astype(int)
df_arrays['Age'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 9 entries, 0 to 8
Series name: Age
Non-Null Count  Dtype
--------------  -----
9 non-null      int32
dtypes: int32(1)
memory usage: 164.0 bytes

In [112]:
df_arrays['height_cm'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 9 entries, 0 to 8
Series name: height_cm
Non-Null Count  Dtype
--------------  -----
9 non-null      object
dtypes: object(1)
memory usage: 200.0+ bytes

In [113]:
# Type conversion to numeric
df_arrays['height_cm'] = pd.to_numeric(df_arrays['height_cm'])
df_arrays['height_cm'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 9 entries, 0 to 8
Series name: height_cm
Non-Null Count  Dtype
--------------  -----
9 non-null      int64
dtypes: int64(1)
memory usage: 200.0 bytes

### Q3 Dataframe Slicing operations

In [114]:
#select specific rows
print(f"Print the first row using .loc: \n{df_arrays.loc[0]}")
print(f"\nPrint the first row using .iloc: \n{df_arrays.iloc[0]}")
print(f"\nPrint the fifth row using .loc: \n{df_arrays.loc[4]}")
print(f"\nPrint the fifth row using .iloc: \n{df_arrays.iloc[4]}")

Print the first row using .loc:
Name             Sunita
Age                  25
Occupation     Engineer
Locations     Kathmandu
height_cm           170
Name: 0, dtype: object

Print the first row using .iloc:
Name             Sunita
Age                  25
Occupation     Engineer
Locations     Kathmandu
height_cm           170
Name: 0, dtype: object

Print the fifth row using .loc:
Name             Hari
Age                22
Occupation     Singer
Locations     Pokhara
height_cm         180
Name: 4, dtype: object

Print the fifth row using .iloc:
Name             Hari
Age                22
Occupation     Singer
Locations     Pokhara
height_cm         180
Name: 4, dtype: object

In [115]:
#selecting specific columns
print(f"Print the first column using .loc: \n{df_arrays.loc[:, 'Name']}")
print(f"\nPrint the first column using .iloc: \n{df_arrays.iloc[:, 0]}")
print(f"\nPrint the third column using .loc: \n{df_arrays.loc[:, 'Occupation']}")
print(f"\nPrint the third column using .iloc: \n{df_arrays.iloc[:, 2]}")

Print the first column using .loc:
0       Sunita
1       Rajesh
2       Sarita
3    Prashjeev
4         Hari
5      Bahadur
6       Sarita
7    Prashjeev
8       Bardan
Name: Name, dtype: object

Print the first column using .iloc:
0       Sunita
1       Rajesh
2       Sarita
3    Prashjeev
4         Hari
5      Bahadur
6       Sarita
7    Prashjeev
8       Bardan
Name: Name, dtype: object

Print the third column using .loc:
0    Engineer
1      Doctor
2      Artist
3    Engineer
4      Singer
5        Neta
6     Dentist
7    Engineer
8     Student
Name: Occupation, dtype: object

Print the third column using .iloc:
0    Engineer
1      Doctor
2      Artist
3    Engineer
4      Singer
5        Neta
6     Dentist
7    Engineer
8     Student
Name: Occupation, dtype: object

In [116]:
#slicing rows
print(f"Print the first 3 rows using .loc: \n{df_arrays.loc[:2]}")
print(f"\nPrint the first 3 rows using .iloc: \n{df_arrays.iloc[:3]}")
print(f"\nPrint the 3rd to 6th row using .loc: \n{df_arrays.loc[2:5]}")
print(f"\nPrint the 3rd to 6th row using .iloc: \n{df_arrays.iloc[2:6]}")

Print the first 3 rows using .loc:
     Name  Age Occupation  Locations  height_cm
0  Sunita   25   Engineer  Kathmandu        170
1  Rajesh   30     Doctor  Kathmandu        172
2  Sarita   35     Artist  Kathmandu        140

Print the first 3 rows using .iloc:
     Name  Age Occupation  Locations  height_cm
0  Sunita   25   Engineer  Kathmandu        170
1  Rajesh   30     Doctor  Kathmandu        172
2  Sarita   35     Artist  Kathmandu        140

Print the 3rd to 6th row using .loc:
        Name  Age Occupation  Locations  height_cm
2     Sarita   35     Artist  Kathmandu        140
3  Prashjeev   24   Engineer  Kathmandu        165
4       Hari   22     Singer    Pokhara        180
5    Bahadur   50       Neta    Pokhara        200

Print the 3rd to 6th row using .iloc:
        Name  Age Occupation  Locations  height_cm
2     Sarita   35     Artist  Kathmandu        140
3  Prashjeev   24   Engineer  Kathmandu        165
4       Hari   22     Singer    Pokhara        180
5    Bahadur   50       Neta    Pokhara        200

In [117]:
#slicing columns
print(f"Print the first 3 column using .loc: \n{df_arrays.loc[:, :'Occupation']}")
print(f"\nPrint the first 3 columns using .iloc: \n{df_arrays.iloc[:, :3]}")
print(f"\nPrint the 2nd to  4th columns using .loc: \n{df_arrays.loc[:, 'Age':'Locations']}")
print(f"\nPrint the 2nd to 4th columns using .iloc: \n{df_arrays.iloc[:, 1:4]}")

Print the first 3 column using .loc:
        Name  Age Occupation
0     Sunita   25   Engineer
1     Rajesh   30     Doctor
2     Sarita   35     Artist
3  Prashjeev   24   Engineer
4       Hari   22     Singer
5    Bahadur   50       Neta
6     Sarita   28    Dentist
7  Prashjeev   24   Engineer
8     Bardan   12    Student

Print the first 3 columns using .iloc:
        Name  Age Occupation
0     Sunita   25   Engineer
1     Rajesh   30     Doctor
2     Sarita   35     Artist
3  Prashjeev   24   Engineer
4       Hari   22     Singer
5    Bahadur   50       Neta
6     Sarita   28    Dentist
7  Prashjeev   24   Engineer
8     Bardan   12    Student

Print the 2nd to  4th columns using .loc:
   Age Occupation  Locations
0   25   Engineer  Kathmandu
1   30     Doctor  Kathmandu
2   35     Artist  Kathmandu
3   24   Engineer  Kathmandu
4   22     Singer    Pokhara
5   50       Neta    Pokhara
6   28    Dentist    Pokhara
7   24   Engineer  Kathmandu
8   12    Student    Pokhara

Print the 2nd to 4th columns using .iloc:
   Age Occupation  Locations
0   25   Engineer  Kathmandu
1   30     Doctor  Kathmandu
2   35     Artist  Kathmandu
3   24   Engineer  Kathmandu
4   22     Singer    Pokhara
5   50       Neta    Pokhara
6   28    Dentist    Pokhara
7   24   Engineer  Kathmandu
8   12    Student    Pokhara

In [118]:
#slicing rows and columns together
print(f"Print the 2nd to 5th rows and first 3 columns using .loc: \n{df_arrays.loc[1:4, :'Occupation']}")
print(f"\nPrint the 2nd to 5th rows first 3 columns using .iloc: \n{df_arrays.iloc[1:4, :3]}")

Print the 2nd to 5th rows and first 3 columns using .loc:
        Name  Age Occupation
1     Rajesh   30     Doctor
2     Sarita   35     Artist
3  Prashjeev   24   Engineer
4       Hari   22     Singer

Print the 2nd to 5th rows first 3 columns using .iloc:
        Name  Age Occupation
1     Rajesh   30     Doctor
2     Sarita   35     Artist
3  Prashjeev   24   Engineer

In [119]:
#slicing using boolean indexing

print(f"Print all rows that have age greater than 25: \n{df_arrays[df_arrays['Age'] > 25]}")
print(f"\nPrint all rows that have location as 'Pokhara': \n{df_arrays[df_arrays['Locations'] == 'Pokhara']}")
print(f"\nPrint all rows that have location as 'Pokhara' and age greater than 25: \n{df_arrays[(df_arrays['Locations'] == 'Pokhara') & (df_arrays['Age'] > 25)]}")
print(f"\nPrint all rows that have location as 'Pokhara' or age greater than 25: \n{df_arrays[(df_arrays['Locations'] == 'Pokhara') | (df_arrays['Age'] > 25)]}")

Print all rows that have age greater than 25:
      Name  Age Occupation  Locations  height_cm
1   Rajesh   30     Doctor  Kathmandu        172
2   Sarita   35     Artist  Kathmandu        140
5  Bahadur   50       Neta    Pokhara        200
6   Sarita   28    Dentist    Pokhara        155

Print all rows that have location as 'Pokhara':
      Name  Age Occupation Locations  height_cm
4     Hari   22     Singer   Pokhara        180
5  Bahadur   50       Neta   Pokhara        200
6   Sarita   28    Dentist   Pokhara        155
8   Bardan   12    Student   Pokhara        160

Print all rows that have location as 'Pokhara' and age greater than 25:
      Name  Age Occupation Locations  height_cm
5  Bahadur   50       Neta   Pokhara        200
6   Sarita   28    Dentist   Pokhara        155

Print all rows that have location as 'Pokhara' or age greater than 25:
      Name  Age Occupation  Locations  height_cm
1   Rajesh   30     Doctor  Kathmandu        172
2   Sarita   35     Artist  Kathmandu        140
4     Hari   22     Singer    Pokhara        180
5  Bahadur   50       Neta    Pokhara        200
6   Sarita   28    Dentist    Pokhara        155
8   Bardan   12    Student    Pokhara        160

### Q5 Find and drop duplicates

In [120]:
# Display the first few rows of the DataFrame
print("Original DataFrame:")
print(df_arrays)

# Find duplicates based on all columns
duplicate_rows = df_arrays[df_arrays.duplicated()]

# Display duplicate rows
print("\nDuplicate Rows:")
print(duplicate_rows)

# Drop duplicates and update the DataFrame
df_arrays.drop_duplicates(inplace=True)

# Display the updated DataFrame after dropping duplicates
print("\nDataFrame after dropping duplicates:")
print(df_arrays)

Original DataFrame:
        Name  Age Occupation  Locations  height_cm
0     Sunita   25   Engineer  Kathmandu        170
1     Rajesh   30     Doctor  Kathmandu        172
2     Sarita   35     Artist  Kathmandu        140
3  Prashjeev   24   Engineer  Kathmandu        165
4       Hari   22     Singer    Pokhara        180
5    Bahadur   50       Neta    Pokhara        200
6     Sarita   28    Dentist    Pokhara        155
7  Prashjeev   24   Engineer  Kathmandu        165
8     Bardan   12    Student    Pokhara        160

Duplicate Rows:
        Name  Age Occupation  Locations  height_cm
7  Prashjeev   24   Engineer  Kathmandu        165

DataFrame after dropping duplicates:
        Name  Age Occupation  Locations  height_cm
0     Sunita   25   Engineer  Kathmandu        170
1     Rajesh   30     Doctor  Kathmandu        172
2     Sarita   35     Artist  Kathmandu        140
3  Prashjeev   24   Engineer  Kathmandu        165
4       Hari   22     Singer    Pokhara        180
5    Bahadur   50       Neta    Pokhara        200
6     Sarita   28    Dentist    Pokhara        155
8     Bardan   12    Student    Pokhara        160

### Q6 Create a new column and use the apply function

In [122]:
def adult_or_kid(age):
    if age > 18:
        return "Adult"
    else:
        return "Kid"
df_arrays['adult_or_kid'] = df_arrays['Age'].apply(adult_or_kid)
print("The dataframe after new column was added")
print(df_arrays)

The dataframe after new column was added
        Name  Age Occupation  Locations  height_cm adult_or_kid
0     Sunita   25   Engineer  Kathmandu        170        Adult
1     Rajesh   30     Doctor  Kathmandu        172        Adult
2     Sarita   35     Artist  Kathmandu        140        Adult
3  Prashjeev   24   Engineer  Kathmandu        165        Adult
4       Hari   22     Singer    Pokhara        180        Adult
5    Bahadur   50       Neta    Pokhara        200        Adult
6     Sarita   28    Dentist    Pokhara        155        Adult
8     Bardan   12    Student    Pokhara        160          Kid

### Q7 Summary functions

In [124]:
# Display concise summary information about the DataFrame
df_arrays.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 8
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          8 non-null      object
 1   Age           8 non-null      int32
 2   Occupation    8 non-null      object
 3   Locations     8 non-null      object
 4   height_cm     8 non-null      int64
 5   adult_or_kid  8 non-null      object
dtypes: int32(1), int64(1), object(4)
memory usage: 416.0+ bytes

In [125]:
# Generate descriptive statistics summarizing the central tendency, dispersion, and shape of the DataFrame's distribution for numeric columns
df_arrays.describe()

             Age   height_cm
count   8.000000    8.000000
mean   28.250000  167.750000
std    11.042127   17.782415
min    12.000000  140.000000
25%    23.500000  158.750000
50%    26.500000  167.500000
75%    31.250000  174.000000
max    50.000000  200.000000

In [126]:
# returns a Series containing counts of unique values in a DataFrame column.
df_arrays['Locations'].value_counts()

Locations
Kathmandu    4
Pokhara      4
Name: count, dtype: int64

In [129]:
# Calculates the correlation between columns in a DataFrame
df_arrays[["Age", "height_cm"]].corr()

                Age  height_cm
Age        1.000000   0.420883
height_cm  0.420883   1.000000

In [131]:
# Calculates the covariance between columns in a DataFrame
df_arrays[["Age", "height_cm"]].cov()

                  Age   height_cm
Age        121.928571   82.642857
height_cm   82.642857  316.214286